Core/src/Documents/ИзменениеПараметровВА/ИзменениеПараметровВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеПараметровВА</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyВидОперации</name>
    <type>
      <types>EnumRef.AzRyВидыОперацийИзменениеПараметровВА</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрименитьВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизацииДоИзменения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетПереоценки</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПереоценкиРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyСпособАмортизации</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииВнеоборотныхАктивов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>Срок использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СпособыНачисленияАмортизацииВнеоборотныхАктивов/СпособыНачисленияАмортизацииВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииВнеоборотныхАктивов</name>
  <enumValues>
    <name>Линейный</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/ИзменениеПараметровВА/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		//+++ Дмгг
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
		//--- Дмгг
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	ЗаполнитьТаблицуВнеоборотныеАктивы();
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновноеПодразделение");
	ОсновноеПодразделение = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКоманды);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновлениеСостоянийВнеоборотныхАктивов");
	
КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли; 
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента); //+++ Дмгг
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВнеоборотныеАктивы

&НаКлиенте
Процедура ВнеоборотныеАктивыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтруктурнаяЕдиница = ОсновноеПодразделение;
	КонецЕсли;	
	
КонецПроцедуры // ВнеоборотныеАктивыПриНачалеРедактирования()

&НаКлиенте
Процедура ВнеоборотныеАктивыОбъемПродукцииРаботДляВычисленияАмортизацииПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	СтруктураДанные = ПолучитьДанныеВнеоборотныйАктив(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	Если НЕ СтруктураДанные.СпособАмортизацииПропорциональноОбъемуПродукции Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='""პროდუქციის (სამუშაოების) მოცულობა ამორტიზაციის გამოსათვლელად"" არ შეიძლება შევსებული იქნას ამორტიზაციის დარიცხვის მითითებული მეთოდისთვის!';ru='""Объем продукции (работ) для исчисления амортизации"" не может быть заполнен для указанного способа начисления амортизации!';en='""The volume of goods (works) for the calculation of depreciation"" can not be completed for the method of calculating depreciation!'"));
		СтрокаТабличнойЧасти.ОбъемПродукцииРаботДляВычисленияАмортизации = 0;
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыОбъемПродукцииРаботДляВычисленияАмортизацииПриИзменении()

&НаКлиенте
Процедура ВнеоборотныеАктивыСрокИспользованияДляВычисленияАмортизацииПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	СтруктураДанные = ПолучитьДанныеВнеоборотныйАктив(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	Если СтруктураДанные.СпособАмортизацииПропорциональноОбъемуПродукции Тогда
		ПоказатьПредупреждение(Неопределено,НСтр("ka='""ამორტიზაციის გამოსათვლელად გამოყენების ვადა"" არ შეიძლება შევსებული იქნას ამორტიზაციის დარიცხვის მითითებული მეთოდისთვის!';ru='""Срок использования для вычисления амортизации"" не может быть заполнен для указанного способа начисления амортизации!';en='""The term of use for the calculation of depreciation"" can not be completed for the method of calculating depreciation!'"));
		СтрокаТабличнойЧасти.СрокИспользованияДляВычисленияАмортизации = 0;
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыСрокИспользованияДляВычисленияАмортизацииПриИзменении()

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	
	МассивВнеоборотныеАктивы = ТаблицаВнеоборотныеАктивы.НайтиСтроки(Новый Структура("ВнеоборотныйАктив", Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ВнеоборотныйАктив));
	
	Если МассивВнеоборотныеАктивы.Количество() <> 0 Тогда
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СрокИспользованияДляВычисленияАмортизации = МассивВнеоборотныеАктивы[0].СрокИспользованияДляВычисленияАмортизации;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ОбъемПродукцииРаботДляВычисленияАмортизации = МассивВнеоборотныеАктивы[0].ОбъемПродукцииРаботДляВычисленияАмортизации;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СтоимостьДляВычисленияАмортизации = МассивВнеоборотныеАктивы[0].СтоимостьДляВычисленияАмортизации;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СтоимостьДляВычисленияАмортизацииДоИзменения = МассивВнеоборотныеАктивы[0].СтоимостьДляВычисленияАмортизации;
		Если НЕ ИспользоватьТолькоРегламентированныйПланСчетов Тогда //+++ Дмгг
			Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СчетЗатрат = МассивВнеоборотныеАктивы[0].СчетЗатрат;
			Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СчетПереоценки = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПрочиеДоходы");
		КонецЕсли; //--- Дмгг
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СчетЗатратРегл = МассивВнеоборотныеАктивы[0].СчетЗатратРегл;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.НаправлениеДеятельности = МассивВнеоборотныеАктивы[0].НаправлениеДеятельности;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СтруктурнаяЕдиница = МассивВнеоборотныеАктивы[0].Подразделение;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.Адрес = МассивВнеоборотныеАктивы[0].Адрес;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = МассивВнеоборотныеАктивы[0].ГодовойПроцентАмортизацииДляУменьшенногоОстатка;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = МассивВнеоборотныеАктивы[0].ЛиквидационнаяСтоимостьДляУменьшенногоОстатка;
	Иначе
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СрокИспользованияДляВычисленияАмортизации = 0;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ОбъемПродукцииРаботДляВычисленияАмортизации = 0;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СтоимостьДляВычисленияАмортизации = 0;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.СтоимостьДляВычисленияАмортизацииДоИзменения = 0;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0;
		Элементы.ВнеоборотныеАктивы.ТекущиеДанные.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = 0;
	КонецЕсли;
	
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	СтруктураДанные = ПолучитьДанныеВнеоборотныйАктив(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	Если СтруктураДанные.СпособАмортизацииПропорциональноОбъемуПродукции Тогда
		СтрокаТабличнойЧасти.СрокИспользованияДляВычисленияАмортизации = 0;
		СтрокаТабличнойЧасти.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0;
		СтрокаТабличнойЧасти.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = 0;
	ИначеЕсли СтруктураДанные.СпособАмортизацииЛинейный Тогда
		СтрокаТабличнойЧасти.ОбъемПродукцииРаботДляВычисленияАмортизации = 0;
		СтрокаТабличнойЧасти.ГодовойПроцентАмортизацииДляУменьшенногоОстатка = 0;
		СтрокаТабличнойЧасти.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка = 0;
	ИначеЕсли СтруктураДанные.СпособАмортизацииУменьшенногоОстатка Тогда
		СтрокаТабличнойЧасти.СрокИспользованияДляВычисленияАмортизации = 0;
		СтрокаТабличнойЧасти.ОбъемПродукцииРаботДляВычисленияАмортизации = 0;
	КонецЕсли;
	
КонецПроцедуры // ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура заполняет таблицу курсов валют
//
Процедура ЗаполнитьТаблицуВнеоборотныеАктивы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК Подразделение,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПараметрыАмортизацииСрезПоследних.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПараметрыАмортизацииСрезПоследних.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&ДатаДокумента, Организация = &Организация
	//Паганини#Bug_
	|	И Регистратор <> &Регистратор
	//_Паганини#Bug
	|) КАК ПараметрыАмортизацииСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Компания);
	//Паганини#Bug_
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	//_Паганини#Bug
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаВнеоборотныеАктивы.Загрузить(ТаблицаРезультатаЗапроса);
	
КонецПроцедуры // ЗаполнитьТаблицуВнеоборотныеАктивы()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"РазностьДат",
		РазностьДат
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДоговорПриИзменении.
//
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"Компания",
		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация)
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
Функция ПолучитьДанныеВнеоборотныйАктив(ВнеоборотныйАктив)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("СпособАмортизацииПропорциональноОбъемуПродукции"	, ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.ПропорциональноОбъемуПродукции);
	СтруктураДанные.Вставить("СпособАмортизацииЛинейный"						, ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.Линейный);
	СтруктураДанные.Вставить("СпособАмортизацииУменьшенногоОстатка"				, ВнеоборотныйАктив.СпособАмортизации = Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеВнеоборотныйАктив()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыСчетПереоценкиРеглПриИзменении(Элемент)
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(ТекСтрока.СчетПереоценкиРегл, ТекСтрока.СчетПереоценки);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	П = Новый Структура;
	П.Вставить("Ключ", ТекСтрока.Адрес);
	
	ОткрытьФорму("Справочник.Адреса.ФормаВыбора", П, ЭтаФорма,,,,Новый ОписаниеОповещения("РедактироватьАдресаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	ТекСтрока.Адрес    =    ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдресАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;

    знТекст    =    ?(ПустаяСтрока(Текст), ТекСтрока.Адрес, Текст);
    ДанныеВыбора    =    ПолучитьДанныеВыбораПоАдресу(Элемент, знТекст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАдресаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Результат) Тогда 
		ТекСтрока.Адрес = Результат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВыбораПоАдресу(Элемент, Адрес, СтандартнаяОбработка)

    // Выключим стандартную обработку
    СтандартнаяОбработка    =    Ложь;
    
    // Определим структуру для получения параметров отбора, 
    // так как стандартный выбор мы выключим значения структуры пусты                                                            
    ПараметрыПодбора    =    Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
                                Новый Структура(), // Здесь можно установить отбор
                                "",                // Передаем введенный в поле текст
                                ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
                                
    // Дополним стандартную структуру с дополнительными параметрами для поиска по адресу
    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Адрес", Адрес));
    
    
    // Передаем адрес и получаем список выбора
    Возврат    ПолучитьДанныеВыбора(Тип("СправочникСсылка.Адреса"), ПараметрыПодбора);

КонецФункции


// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
